accountsProxy/accountsProxy/src/gateway/duMockTargetServer/apiproxy/resources/node/du-mocks/services/GetPrepaidBlackberryServices-Response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webservices.com/LCE/Du/WebServices" xmlns:head="http://www.du.ae/LCE/HeaderResponse" xmlns:lcew="http://xmlns.du.ae/LCE/Business/LCEWebServiceResponse" xmlns:get="http://xmlns.du.ae/LCE/Business/ServiceManagement/GetPrepaidBlackberryServices">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetPrepaidBlackberryServicesResponse>
         <Response>
            <head:Header>
               <!--Optional:-->
               <head:RequestId>?</head:RequestId>
               <!--Optional:-->
               <head:CorrelationId>?</head:CorrelationId>
               <head:ResponseCode>?</head:ResponseCode>
               <!--Optional:-->
               <head:ResponseMessage>?</head:ResponseMessage>
               <!--Optional:-->
               <head:ErrorCode>?</head:ErrorCode>
               <!--Optional:-->
               <head:ErrorDescription>?</head:ErrorDescription>
            </head:Header>
            <!--Optional:-->
            <lcew:Body>
               <!--Optional:-->
               <get:Type>?</get:Type>
               <!--Optional:-->
               <get:ActivationStatus>?</get:ActivationStatus>
               <!--Optional:-->
               <get:ActivationConfirmation>?</get:ActivationConfirmation>
               <!--Optional:-->
               <get:ActivationRequestDate>?</get:ActivationRequestDate>
               <!--Optional:-->
               <get:ExpirationDate>?</get:ExpirationDate>
               <!--Optional:-->
               <get:DeactivationDate>?</get:DeactivationDate>
               <!--Optional:-->
               <get:GracePeriodActive>?</get:GracePeriodActive>
               <!--Optional:-->
               <get:GracePeriodEndDate>?</get:GracePeriodEndDate>
               <!--Optional:-->
               <get:Balance>?</get:Balance>
               <!--Optional:-->
               <get:BalanceExpiryDate>?</get:BalanceExpiryDate>
            </lcew:Body>
         </Response>
      </web:GetPrepaidBlackberryServicesResponse>
   </soapenv:Body>
</soapenv:Envelope>